config.org
#+TITLE:    Doom Emacs configuration
#+author:   Nopanun Laochunhanun
#+DATE:     Fri Dec 10 15:38:47 2021
#+PROPERTY: header-args :results silent
#+SINCE:    v3.0.0-alpha
#+STARTUP:  content

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; For e.g. GPG configuration, email clients, file templates and snippets.
(setq user-full-name "Nopanun Laochunhanun"
      user-mail-address "nopanun@pm.me")
#+end_src

* Table of Contents :TOC_3:noexport:
- [[#system][System]]
  - [[#emacs][Emacs]]
  - [[#multitasking][Multitasking]]
    - [[#split-windows][Split windows]]
  - [[#power][Power]]
    - [[#battery-usage][Battery usage]]
  - [[#trash][Trash]]
  - [[#troubleshoot][Troubleshoot]]
    - [[#inhibit-cl-warning][Inhibit cl warning]]
    - [[#github-remote-ssh-always-ask-for-passphrase][Github remote SSH always ask for passphrase]]
    - [[#why-is-emacsdoom-slow][Why is Emacs/Doom slow?]]
- [[#personalization][Personalization]]
  - [[#colors][Colors]]
    - [[#choose-your-mode][Choose your mode:]]
  - [[#themes][Themes]]
  - [[#fonts][Fonts]]
  - [[#modeline][Modeline]]
  - [[#window--frame][Window & frame]]
  - [[#miscellaneous][Miscellaneous]]
- [[#keyboard-shortcuts][Keyboard Shortcuts]]
- [[#apps][Apps]]
- [[#time--language][Time & language]]
  - [[#date--time][Date & time]]
  - [[#typing][Typing]]
    - [[#dabbrev][Dabbrev]]
- [[#accessibility][Accessibility]]
  - [[#visual-effects][Visual effects]]
  - [[#text-cursor][Text cursor]]
- [[#privacy--security][Privacy & security]]
- [[#modules][Modules]]
  - [[#completion][Completion]]
    - [[#corfu][Corfu]]
    - [[#tabnine][Tabnine]]
    - [[#vertico][Vertico]]
  - [[#ui][UI]]
    - [[#deft][Deft]]
    - [[#doom-dashboard][doom-dashboard]]
    - [[#tab-workspaces-work-in-progress][Tab-Workspaces (work in progress)]]
    - [[#window-navigation][Window Navigation]]
    - [[#modus][modus]]
    - [[#treemacs][Treemacs]]
    - [[#fixmee][fixmee]]
  - [[#editor][Editor]]
    - [[#evil][Evil]]
    - [[#format][Format]]
  - [[#emacs-1][emacs]]
    - [[#dired][dired]]
  - [[#tools][Tools]]
    - [[#arrayify][Arrayify]]
    - [[#brief][Brief]]
    - [[#fzf][fzf]]
    - [[#magit-forge][magit +forge]]
    - [[#tree-sitter][Tree-sitter]]
  - [[#programming-language][Programming Language]]
    - [[#clojure][Clojure]]
    - [[#javascript][JavaScript]]
    - [[#web][Web]]
    - [[#org-mode][Org-mode]]
  - [[#email-email][Email :email:]]
    - [[#mu4e][mu4e]]
  - [[#apps-1][Apps]]
    - [[#edit-server][Edit-Server]]
    - [[#mastodon][Mastodon]]
    - [[#telega---full-featured-unofficial-client-for-telegram-platform-for-gnu-emacs][Telega - full featured unofficial client for Telegram platform for GNU Emacs.]]
  - [[#terminal][Terminal]]
    - [[#vterm][vterm]]
  - [[#configure][Configure]]
    - [[#default][default]]
- [[#local-configures][Local Configures]]
  - [[#directory-local-variables][Directory Local Variables]]
  - [[#safe-local-variables][safe-local-variables]]
  - [[#marking-the-root-of-a-project][Marking the root of a project]]

* System
#+begin_src emacs-lisp
;;
;;; System
#+end_src
** Emacs
#+begin_src emacs-lisp :noweb no-export
(setq <<split-windows>>
      truncate-string-ellipsis  "…")    ; Unicode ellispis are nicer than "...",
                                        ; and also save /precious/ space
(global-subword-mode 1)                 ; Iterate through CamelCase words
#+end_src
** Multitasking
*** Split windows
Automatically resize and arrange windows on your screen
#+name: split-windows
#+begin_src emacs-lisp :tangle no
window-combination-resize t ; take new window space from all other windows
#+end_src

When I split a window, show prompt for which buffer I want to see
#+begin_src emacs-lisp
(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (consult-buffer))
#+end_src
** Power
*** Battery usage
#+begin_src emacs-lisp
(unless (equal "Battery status not available" (battery)) ; on laptops…
  (display-battery-mode 1)) ; it's nice to know how much power you have
#+end_src
** Trash
#+begin_src emacs-lisp
(setq-default delete-by-moving-to-trash t) ; Delete files to trash
#+end_src
** Troubleshoot
*** Inhibit cl warning
#+begin_src emacs-lisp
(setq byte-compile-warnings '(not cl-functions))
#+end_src
*** Github remote SSH always ask for passphrase
Troubleshoot by load Key-chain Environment Variables
[[https://github.com/tarsius/keychain-environment][tarsius/keychain-environment: Loads keychain environment variables into emacs]]
Captured On: [2021-11-12 Fri 23:05]

#+begin_src emacs-lisp
(use-package keychain-environment
  :defer t
  :init (keychain-refresh-environment))
#+end_src

*** Why is Emacs/Doom slow?
Some advice from @hlissner on [[https://discourse.doomemacs.org/t/why-is-emacs-doom-slow/83/3][Why is Emacs/Doom slow? - Discussion / Doom Emacs Discourse]]
Captured On: [2021-12-11 Sat 14:35]

1. Disable idle code-completion (i.e. completion-as-you-type).
   #+begin_src emacs-lisp
(setq company-idle-delay nil)
   #+end_src
   #+begin_quote
   Add the above sexp to make code completion manual (on =C-SPC=, by default)
   That way, you only need to suffer that slowness once, when it is needed.
   #+end_quote
2. [[file:init.org::*Disable some of Doom’s slowest modules.][Disable some of Doom’s slowest modules.]]
3. Turn off line numbers:
   #+name: my-line-numbers-setting
   #+begin_src emacs-lisp :tangle no
display-line-numbers-type  nil
   #+end_src
   #+begin_quote
   It’s known to slow down scrolling, in particular. Line numbers are pretty slow
   all around. The performance boost of disabling them outweighs the utility of
   always keeping them on.
   #+end_quote
4. Turn off the “prettification” of org-mode, by disabling the =+pretty=
   flag on the =:lang org= module (if you have it on).

   You can go to an extreme by disabling more of its eye-candy:
   #+begin_src emacs-lisp :tangle no
(after! org
  (setq org-fontify-quote-and-verse-blocks nil
        org-fontify-whole-heading-line nil
        org-hide-leading-stars nil
        org-startup-indented nil))
   #+end_src
5. Change your font(s). Emacs struggles to display some unicode characters
   with certain fonts. It sometimes struggles to display multiple fonts at
   once – as is the case if your primary font doesn’t support certain symbols
   (Emacs will fall back to another font to try to display them, which
   appears to be more expensive on some systems than others – or with some
   fonts, more than others)
6. Replace the =:ui modeline= module with =:ui (modeline +light)=. The
   doom-modeline can be unpredictably slow in some edge cases. The =+light=
   variant is a work-in-progress replacement aiming to provide a lighter
   (albeit less featureful) mode line.
7. Check out “[[https://discourse.doomemacs.org/t/119][Common configuration mistakes]]”.


* Personalization
UI stuff

#+begin_src emacs-lisp :noweb no-export
;;
;;; UI

(setq <<my-line-numbers-setting>>
      <<my-treemacs-settings>>
      <<my-fonts-settings>>
      <<my-frame-settings>>)

<<my-theme-script>>
#+end_src

** Colors
Look at the options and choose your [[mode][mode]]
#+name:     my-theme-modes
#+begin_src emacs-lisp :tangle no
(default    'doom-one)
(light      'doom-one-light)
(dark       'doom-dracula)
(custom     'doom-vibrant)
#+end_src

: default, light, dark, custom

or

#+name:     auto-dark-mode
#+begin_src emacs-lisp :tangle no
auto       'auto
#+end_src

: auto

#+name: auto-mode-settings
#+begin_src emacs-lisp :tangle no
(light-theme-begin 6)   ; Hour to turn on  `light' theme
(light-theme-end   17)  ; Hour to turn off `light' theme
#+end_src

~auto~ mode is the automatic theme switching. If ~auto~ mode was
set, ~doom-theme~ will be set to the ~light~ or ~dark~ theme according to
the hour in the current time, ~light-theme-begin~ and ~light-theme-end~.

*** Choose your mode:
#+name: mode
#+begin_src emacs-lisp :tangle no
auto
#+end_src

** Themes
#+name: my-theme-script
#+begin_src emacs-lisp :noweb no-export :tangle no
(let ((my-doom-color '<<mode>>))
  (eval                           ; theme varies to the value of `my-doom-color'
   `(let ((<<auto-dark-mode>>)
          <<my-theme-modes>>)
      (if (eq ,my-doom-color 'auto)
          (run-with-timer
           0 3600                       ; check for every hour
           (defun synchronize-theme (light dark)
             "Sets the theme according to the hour in the current time.
If the hour is (both inclusive) in `light-theme-hours' then
`light' theme is loaded, otherwise `dark' theme is loaded."
             (let* ((hour (string-to-number
                           (substring (current-time-string) 11 13)))
                    <<auto-mode-settings>>
                    (light-theme-hours (number-sequence
                                        light-theme-begin light-theme-end))
                    (now (if (member hour light-theme-hours) light dark)))
               (unless (equal now doom-theme)
                 (setq doom-theme now) (doom-init-theme-h)))) light dark)
        ;; Specific color mode
        (setq doom-theme ,my-doom-color) (doom-init-theme-h)))))
#+end_src

** Fonts
+ JetBrains Mono
+ Noto Serif
+ [[https://bboxtype.com/typefaces/FiraGO/][FiraGO]] Global Language Extension of the Open Font Family Fira Sans
  Arabic · Devanagari · Georgian · Hebrew · Thai
#+name: my-fonts-settings
#+begin_src emacs-lisp :tangle no
doom-font                  (font-spec :family "JetBrains Mono"
                                      :size 12 :weight 'light)
doom-variable-pitch-font   (font-spec :family "Noto Serif"     :size 13)
vertico-posframe-font      (font-spec :family "JetBrains Mono" :size 15)
doom-unicode-font          (font-spec :family "FiraGO" :weight 'Book)
doom-serif-font            doom-variable-pitch-font
#+end_src
** Modeline
I want to use [[https://github.com/TeMPOraL/nyan-mode][Nyan Mode]] with doom-modeline and I want to add =+nyan= flag to
the modeline module. What I need to do is hack the =ui/modeline/packages.el=
file locates in .emacs.d/modules directory to add the nyan-mode package, add
=+nyan.el= for config file and add some code into the module. (I've done this
in my doom-emacs fork, and I'm attempting to introduce it to upstream soon)

** Window & frame
#+name: my-frame-settings
#+begin_src emacs-lisp :tangle no
default-frame-alist        (append default-frame-alist
                                   '((height . 48)
                                     (width  . 160)
                                     (inhibit-double-buffering . t)))
#+end_src
** Miscellaneous
Extra colors for Info-mode
#+begin_src emacs-lisp
(use-package! info-colors
  :hook (Info-selection . info-colors-fontify-node))
#+end_src

* Keyboard Shortcuts :keybinds:
For the speed of expressions
#+begin_src emacs-lisp :noweb no-export
;;
;;; keybinds

(map! :n  "g+"    #'evil-numbers/inc-at-pt
      :v  "g+"    #'evil-numbers/inc-at-pt-incremental
      :nv "g="    #'er/expand-region
      :gi "C-="   #'er/expand-region
      :n  "C-0"   #'doom/reset-font-size
      :n  "C-+"   #'text-scale-increase
      :n  "M-C-+" #'doom/increase-font-size
      :n  "C-SPC" #'just-one-space
      <<cape-bindings>>
      <<dashboard>>
      <<:ui hydra>>
      (:when (featurep! :config default)
       <<default>>)
      <<vterm-kbd>>
      :desc "Load doom-theme on the fly" "<f5>" (cmd! (doom-init-theme-h))
      (:prefix "C-x"
       :when (featurep! :ui popup)
       :desc "Open this buffer in a popup" "j" #'+popup/buffer)
      :map mode-specific-map            ; C-c
      (:when (featurep! :tools eval)
       :desc "Evaluate line/region"        "e" #'+eval/line-or-region
       :desc "Evaluate & replace region"   "E" #'+eval/region-and-replace)
      (:when (featurep! :tools fzf)
       :desc "Fuzzy find file in project"  "t" #'fzf-projectile))
#+end_src

* Apps
* Time & language
#+begin_src emacs-lisp
;;
;;; Time & language
#+end_src
** Date & time
#+begin_src emacs-lisp
(display-time-mode 1)                   ; Enable time in the mode-line
#+end_src
** Typing :completion:preferences:
*** Dabbrev
Swap =M-/= and =C-M-/=
#+begin_src emacs-lisp
(use-package dabbrev
  :bind (("M-/" . dabbrev-completion)   ; Swap M-/ and C-M-/
         ("C-M-/" . dabbrev-expand)))
#+end_src

* Accessibility
#+begin_src emacs-lisp
;;
;;; Accessibility
#+end_src
