config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; For e.g. GPG configuration, email clients, file templates and snippets.
(setq user-full-name "Nopanun Laochunhanun"
      user-mail-address "nopanun@pm.me")

;;
;;; System

(setq window-combination-resize t ; take new window space from all other windows
      truncate-string-ellipsis  "…")    ; Unicode ellispis are nicer than "...",
                                        ; and also save /precious/ space
(global-subword-mode 1)                 ; Iterate through CamelCase words

(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (consult-buffer))

(unless (equal "Battery status not available" (battery)) ; on laptops…
  (display-battery-mode 1)) ; it's nice to know how much power you have

(setq-default delete-by-moving-to-trash t) ; Delete files to trash

(setq byte-compile-warnings '(not cl-functions))

(use-package keychain-environment
  :defer t
  :init (keychain-refresh-environment))

(setq company-idle-delay nil)

;;
;;; UI

(setq display-line-numbers-type  nil
      +treemacs-git-mode         'deferred
      doom-themes-treemacs-theme 'doom-colors
      doom-font                  (font-spec :family "JetBrains Mono"
                                            :size 12 :weight 'light)
      doom-variable-pitch-font   (font-spec :family "Noto Serif"     :size 13)
      vertico-posframe-font      (font-spec :family "JetBrains Mono" :size 15)
      doom-unicode-font          (font-spec :family "FiraGO" :weight 'Book)
      doom-serif-font            doom-variable-pitch-font
      default-frame-alist        (append default-frame-alist
                                         '((height . 48)
                                           (width  . 160)
                                           (inhibit-double-buffering . t))))

(let ((my-doom-color 'auto))
  (eval                           ; theme varies to the value of `my-doom-color'
   `(let ((auto       'auto)
          (default    'doom-one)
          (light      'doom-one-light)
          (dark       'doom-dracula)
          (custom     'doom-vibrant))
      (if (eq ,my-doom-color 'auto)
          (run-with-timer
           0 3600                       ; check for every hour
           (defun synchronize-theme (light dark)
             "Sets the theme according to the hour in the current time.
If the hour is (both inclusive) in `light-theme-hours' then
`light' theme is loaded, otherwise `dark' theme is loaded."
             (let* ((hour (string-to-number
                           (substring (current-time-string) 11 13)))
                    (light-theme-begin 6)   ; Hour to turn on  `light' theme
                    (light-theme-end   17)  ; Hour to turn off `light' theme
                    (light-theme-hours (number-sequence
                                        light-theme-begin light-theme-end))
                    (now (if (member hour light-theme-hours) light dark)))
               (unless (equal now doom-theme)
                 (setq doom-theme now) (doom-init-theme-h)))) light dark)
        ;; Specific color mode
        (setq doom-theme ,my-doom-color) (doom-init-theme-h)))))

(use-package! info-colors
  :hook (Info-selection . info-colors-fontify-node))

;;
;;; keybinds

(map! :n  "g+"    #'evil-numbers/inc-at-pt
      :v  "g+"    #'evil-numbers/inc-at-pt-incremental
      :nv "g="    #'er/expand-region
      :gi "C-="   #'er/expand-region
      :n  "C-0"   #'doom/reset-font-size
      :n  "C-+"   #'text-scale-increase
      :n  "M-C-+" #'doom/increase-font-size
      :n  "C-SPC" #'just-one-space
