config.org
** Visual effects
#+name: visual-effects-settings
#+begin_src emacs-lisp :tangle no
(setq scroll-margin 2)                  ; It's nice to maintain a little margin
;;scroll-preserve-screen-position 'always ; Don't have `point' jump around
#+end_src
** Text cursor
#+name: my-cursor-settings
#+begin_src emacs-lisp
(setq-default x-stretch-cursor t)       ; Stretch cursor to the glyph width
#+end_src
* Privacy & security
#+begin_src emacs-lisp
;;
;;; Security

(setq password-cache-expiry nil)        ; I can trust my computers … can't I?
#+end_src
* Modules
#+begin_src emacs-lisp
;;
;;; Modules
#+end_src
** Completion :completion:
*** Corfu
*Configuration*
- Set bindings (evil)
  #+name: cape-bindings
  #+begin_src emacs-lisp :tangle no
;; evil Omni-completion, Bind dedicated completion commands
(:when (and (featurep! :editor evil)
            (featurep! :completion corfu))
 :i "C-@"   (cmds! (not (minibufferp)) #'completion-at-point)
 :i "C-SPC" (cmds! (not (minibufferp)) #'completion-at-point)
 :prefix "C-x"
 :i "C-p"   #'completion-at-point  ; capf
 :i "C-l"   #'cape-line
 :i "C-k"   #'+cape/dict-or-keywords
 :i "C-a"   #'cape-abbrev
 :i "s"     #'cape-ispell
 (:unless (featurep! :completion company)
  :i "C-s"  #'+cape/yasnippet)
 :i "C-d"   #'cape-dabbrev
 :i "d"     #'dabbrev-completion
 :i "C-f"   #'cape-file
 :i "C-'"   #'cape-symbol
 :i "C-]"   #'complete-tag         ; etags
 :i "C-\\"  #'cape-tex
 :i "&"     #'cape-sgml
 :i "C-r"   #'cape-rfc1345)
  #+end_src

- Additional movement commands
  #+name: additional-move-cmds
  #+begin_src emacs-lisp :tangle no
(defun corfu-beginning-of-prompt ()
  "Move to beginning of completion input."
  (interactive)
  (corfu--goto -1)
  (goto-char (car completion-in-region--data)))

(defun corfu-end-of-prompt ()
  "Move to end of completion input."
  (interactive)
  (corfu--goto -1)
  (goto-char (cadr completion-in-region--data)))
  #+end_src

- Transfer to the minibuffer
  #+name: to-minibuffer
  #+begin_src emacs-lisp :tangle no
(defun corfu-move-to-minibuffer ()
  (interactive)
  (let ((completion-extra-properties corfu--extra)
        completion-cycle-threshold completion-cycling)
    (apply #'consult-completion-in-region completion-in-region--data)))
  #+end_src

- Auto-commit
  #+name: auto-commit
  #+begin_src org :tangle no
Corfu allows you to specify a ~corfu-commit-predicate~, which you can use to
instruct corfu whether to auto-commit completion candidates. It's run after
every new key event. In the example below, the candidate is auto-committed when
"." is entered, but not after a space (e.g. for orderless regexps), on any key
aside from space if only one candidate exists, and when the 1st candidate is an
exact match for what you have typed in the buffer on a wide variety of key
presses
  #+end_src
  #+name: auto-commit.el
  #+begin_src emacs-lisp :tangle no
(defun my/corfu-commit-predicate ()
  "Auto-commit candidates if:
1. A `.' is typed, except after a SPACE.
2. A selection was made, aside from entering SPACE.
3. Just one candidate exists, and we continue to non-symbol info.
4. The 1st match is exact."
  (cond
   ((seq-contains-p (this-command-keys-vector) ?.)
    (or (string-empty-p (car corfu--input))
        (not (string= (substring (car corfu--input) -1) " "))))

   ((/= corfu--index corfu--preselect) ; a selection was made
    (not (seq-contains-p (this-command-keys-vector) ? )))

   ((eq corfu--total 1) ;just one candidate
    (seq-intersection (this-command-keys-vector) [?: ?, ?\) ?\] ?\( ? ]))

   ((and corfu--input ; exact 1st match
         (string-equal (substring (car corfu--input) corfu--base)
                       (car corfu--candidates)))
    (seq-intersection (this-command-keys-vector) [?: ?. ?, ?\) ?\] ?\" ?' ? ]))))

(setq corfu-commit-predicate #'my/corfu-commit-predicate)
  #+end_src

**** README.org
#+begin_src org :tangle modules/completion/corfu/README.org :noweb no-export :mkdirp yes
,#+TITLE:   completion/corfu
,#+DATE:    December 6, 2021
,#+SINCE:   v3.0.0-alpha
,#+STARTUP: inlineimages nofold

,* Table of Contents :TOC_3:noexport:
- [[#description][Description]]
  - [[#maintainers][Maintainers]]
  - [[#module-flags][Module Flags]]
  - [[#plugins][Plugins]]
  - [[#hacks][Hacks]]
- [[#prerequisites][Prerequisites]]
- [[#features][Features]]
- [[#configuration][Configuration]]
- [[#troubleshooting][Troubleshooting]]

,* Description
[[https://github.com/minad/corfu][GitHub - minad/corfu: corfu.el - Completion Overlay Region FUnction]]
in the form of doom module by [[https://git.sr.ht/~gagbo][@Gerry_Agbobada]]. The primary packages are:

+ Corfu, which provides a completion overlay region function
+ Cape, which provides a bunch of Completion At Point Extensions
+ kind-icon, which provides an colorful icon/text prefix based on :company-kind
+ Company, which provides completion backends to be converted to Capf

,** Maintainers
+ [[https://git.sr.ht/~gagbo][@Gerry_Agbobada]] (Author)
+ [[https://github.com/thaenalpha][@thaenalpha]]

,** Module Flags
+ =+orderless= optionally use the [[https://github.com/oantolin/orderless][orderless]] completion style which provides
  better filtering methods by filters through candidates those match space-
  separated regular expressions.
+ =+tabnine= use Tabnine code completion for capf

,** Plugins
+ [[https://github.com/minad/corfu][corfu]]
+ [[https://github.com/minad/cape][cape]]
+ [[https://github.com/jdtsmith/kind-icon][kind-icon]]
+ [[https://github.com/oantolin/orderless][orderless]] (=+orderless=)
+ [[https://github.com/company-mode/company-mode][company-mode]]
+ <<company-tabnine>>

,** Hacks
# A list of internal modifications to included packages; omit if unneeded

,* Prerequisites
This module has no prerequisites.

,* Features
,** TAB-and-Go completion
Pressing TAB moves to the next candidate and further input will then commit the
selection.

,** Code completion
By default, completion is triggered after a short idle period or with the
=C-SPC= key. While the popup is visible, the following keys are available:

| Keybind | Description                              |
|---------+------------------------------------------|
| =C-n=   | Go to next candidate                     |
| =C-p=   | Go to previous candidate                 |
| =C-j=   | (evil) Go to next candidate              |
| =C-k=   | (evil) Go to previous candidate          |
| =C-h=   | Display documentation (if available)     |
| =C-u=   | Move to previous page of candidates      |
| =C-d=   | Move to next page of candidates          |
| =C-SPC= | Complete common                          |
| =TAB=   | Complete common or select next candidate |
| =S-TAB= | Select previous candidate                |

,** Vim-esque omni-completion prefix (C-x)
In the spirit of Vim's omni-completion, the following insert mode keybinds are
available to evil users to access specific company backends:

| Keybind   | Description                       |
|-----------+-----------------------------------|
| =C-x C-]= | Complete etags                    |
| =C-x C-f= | Complete file path                |
| =C-x C-k= | Complete from dictionary/keyword  |
| =C-x C-l= | Complete full line                |
| =C-x C-p= | Invoke complete-at-point function |
| =C-x C-'= | Complete symbol at point          |
| =C-x C-s= | Complete snippet                  |
| =C-x s=   | Complete spelling suggestions     |
| =C-x C-d= | Complete Corfu dabbrev at point   |
| =C-x d=   | dabbrev-completion at point       |

,* Configuration

,#+begin_quote
Corfu is highly flexible and customizable via ~corfu-*~ customization variables.
For filtering I recommend to give Orderless completion a try, which is
different from the familiar prefix TAB completion. Corfu can be used with the
default completion styles, the use of Orderless is not a necessity. See also
the [[https://github.com/minad/corfu/wiki][Corfu Wiki]] for additional configuration tips. In particular the Lsp-mode
configuration is documented in the Wiki.
@minad (Author of Cape, Corfu, Vertico)
,#+end_quote
Here is an example configuration:

,** Optional customizations

,#+begin_src emacs-lisp
(use-package corfu
  :custom
  (corfu-cycle t)                ; Enable cycling for `corfu-next/previous'
  (corfu-auto t)                 ; Enable auto completion
  (corfu-commit-predicate nil)   ; Do not commit selected candidates on next input
  (corfu-quit-at-boundary t)     ; Automatically quit at word boundary
  (corfu-quit-no-match t)        ; Automatically quit if there is no match
  (corfu-preview-current nil)    ; Disable current candidate preview
  (corfu-preselect-first nil)    ; Disable candidate preselection
  (corfu-echo-documentation nil) ; Disable documentation in the echo area
  (corfu-scroll-margin 5)        ; Use scroll margin)
,#+end_src

,** Enable Corfu only for certain modes.
This module enable ~corfu-global-mode~ by default. You may want to enable Corfu
only for certain modes.
,#+begin_src emacs-lisp
(use-package corfu
  :hook ((prog-mode . corfu-mode)
         (shell-mode . corfu-mode)
         (eshell-mode . corfu-mode))
,#+end_src

,** Completion style
Tune the global completion style settings to your liking!
This affects the minibuffer and non-lsp completion at point.
,#+begin_src emacs-lisp :noweb no-export
(use-package orderless
  :defer t
  :when (featurep! :completion corfu +orderless)
  :init
  <​<optional>​>
  (setq completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '(<​<file-styles>​>)))
,#+end_src

The =+orderless= feature enable ~partial-completion~ for files to allow path
expansion by default. You may prefer to use ~initials~ instead.

,#+name: file-styles
,#+begin_src emacs-lisp :tangle no
(file (styles . (initials)))
,#+end_src

See ~+orderless-dispatch~ in the Consult wiki for an advanced Orderless style
dispatcher.

,#+name: optional
,#+begin_src emacs-lisp :tangle no
(setq orderless-style-dispatchers '(+orderless-dispatch)
      orderless-component-separator #'orderless-escapable-split-on-space)
,#+end_src

,** Auto-Commit

<<auto-commit>>

,#+begin_src emacs-lisp
<<auto-commit.el>>
,#+end_src

,** More additional
See also the [[https://github.com/minad/corfu/wiki][Corfu Wiki]] for additional configuration tips. For more general
documentation read the chapter about completion in the [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Completion.html][Emacs manual]]. If you want
to create your own Capfs, you can find documentation about completion in
the [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Completion.html][Elisp manual]].

,* Troubleshooting
,** Auto trigger commands

If Corfu is not triggering completion with ~corfu-auto~ it can be the case that the command was not called with ~self-insert-command~ or one of the other commands registered in the list ~corfu-auto-commands~. You can fix this by adding the commands you are missing to the list.

,#+begin_src emacs-lisp
(add-to-list 'corfu-auto-commands 'some-special-insert-command)
,#+end_src
#+end_src
**** autoload.el
#+begin_src emacs-lisp :tangle modules/completion/corfu/autoload.el
;;; completion/company/autoload.el -*- lexical-binding: t; -*-

;;;###autoload
(defvar +completion-at-point-function-alist
  '((text-mode cape-dabbrev +cape/yasnippet cape-ispell)
    (prog-mode +cape/yasnippet)
    (conf-mode company-dabbrev-code +cape/yasnippet))
  "An alist matching modes to completion-at-point-functions. The capfs for any mode is
built from this.")

;;;###autodef
(defun set-completion-at-point-function! (modes &rest capfs)
  "Prepends CAPFS (in order) to `completion-at-point-functions' in MODES.

MODES should be one symbol or a list of them, representing major or minor modes.
This will overwrite capfs for MODES on consecutive uses.

If the car of CAPFS is nil, unset the capfs for MODES.

Examples:

  (set-completion-at-point-function! 'js2-mode
    'company-tide 'company-yasnippet)

  (set-completion-at-point-function! 'sh-mode
    '(company-shell :with +cape/yasnippet))

  (set-completion-at-point-function! '(c-mode c++-mode)
    '(:separate company-irony-c-headers company-irony))

  (set-completion-at-point-function! 'sh-mode nil)  ; unsets capfs for sh-mode"
  (declare (indent defun))
  (dolist (mode (doom-enlist modes))
    (if (null (car capfs))
        (setq +completion-at-point-function-alist
              (delq (assq mode +completion-at-point-function-alist)
                    +completion-at-point-function-alist))
      (setf (alist-get mode +completion-at-point-function-alist)
            capfs))))

;;;###autoload
(defun +cape/dict-or-keywords (&optional interactive)
  "`corfu-mode' completion combining `cape-dict' and `cape-keywords'.
If INTERACTIVE is nil the function acts like a capf."
  (interactive (list t))
  (if interactive
      (cape--interactive #'+cape/dict-or-keywords)
    (funcall (cape-super-capf #'cape-keyword #'cape-dict))))

;;;###autoload
(defun +cape/yasnippet (&optional interactive)
  "`corfu-mode' completion for `yasnippet'
If INTERACTIVE is nil the function acts like a capf."
  (interactive (list t))
  (if interactive
      (cape--interactive #'+cape/yasnippet)
    (funcall (cape-company-to-capf #'company-yasnippet))))
#+end_src
