config.org
**** config.el
#+begin_src emacs-lisp :tangle modules/completion/corfu/config.el :noweb no-export
;;; completion/corfu/config.el -*- lexical-binding: t; -*-

;; Reset lsp-completion provider and optionally configure the cape-capf-buster.
(add-hook! 'doom-init-modules-hook
  (after! lsp-mode
    (setq lsp-completion-provider :none)
    (setq-local completion-at-point-functions
                (list (cape-capf-buster #'lsp-completion-at-point)))))

;; Pad before lsp modeline error info
(add-hook! 'lsp-mode-hook
  (setf (caadr (assq 'global-mode-string mode-line-misc-info)) " "))

;; Set orderless filtering for LSP-mode completions
(add-hook! 'lsp-completion-mode-hook
  (setf (alist-get 'lsp-capf completion-category-defaults)
        '((styles . (orderless)))))

;; Fallback cleanly to consult in TUI
(setq-default completion-in-region-function #'consult-completion-in-region)

(use-package! corfu
  :commands corfu-complete
  :hook (doom-first-input . corfu-global-mode)
  :bind (:map corfu-map
         ("TAB"                          . corfu-next)
         ([tab]                          . corfu-next)
         ("S-TAB"                        . corfu-previous)
         ([backtab]                      . corfu-previous)
         ([remap move-beginning-of-line] . corfu-beginning-of-prompt)
         ([remap move-end-of-line]       . corfu-end-of-prompt)
         ("M-m"                          . corfu-move-to-minibuffer)
         ([return]                       . corfu-insert))
  :init
  (setq corfu-cycle t              ; Enable cycling for `corfu-next/previous'
        corfu-auto  t              ; Enable auto completion
        corfu-quit-no-match t      ; Automatically quit if there is no match
        corfu-preselect-first nil) ; Disable candidate preselection

  <<additional-move-cmds>>

  <<to-minibuffer>>

  :config
  (when (and (featurep 'evil) (featurep! :config default +bindings))
    ;; https://github.com/minad/corfu/issues/12#issuecomment-869037519
    (advice-add #'corfu--setup :after #'evil-normalize-keymaps)
    (advice-add #'corfu--teardown :after #'evil-normalize-keymaps)
    (evil-make-intercept-map corfu-map)
    ;; Don't persist corfu popups when switching back to normal mode.
    (add-hook! 'evil-normal-state-entry-hook
      (when corfu--candidates (corfu-quit)))

    (map! (:map corfu-map
           "C-n"    #'corfu-next
           "C-p"    #'corfu-previous
           "C-j"    #'corfu-next
           "C-k"    #'corfu-previous
           "C-h"    #'corfu-show-documentation
           "C-u"    #'corfu-scroll-down
           "C-d"    #'corfu-scroll-up
           "C-v"    #'corfu-scroll-up
           "C-s"    #'corfu-move-to-minibuffer
           "C-`"    #'corfu-move-to-minibuffer
           "C-x j"  #'corfu-move-to-minibuffer
           "C-S-s"  #'completion-at-point)))

  <<auto-commit.el>>)

;; Enable `partial-completion' for files to allow path expansion.
;; You may prefer to use `initials' instead of `partial-completion'.
(use-package! orderless
  :defer t
  :when (featurep! +orderless)
  :init
  ;; Optionally configure the first word as flex filtered.
  (add-hook 'orderless-style-dispatchers
            (defun my/orderless-dispatch-flex-first (_pattern index _total)
              (and (eq index 0) 'orderless-flex)) nil 'local)
  (setq completion-styles '(orderless partial-completion)
        completion-category-defaults nil
        completion-category-overrides '((file
                                         (styles . (partial-completion))))))

(use-package! kind-icon
  :after corfu
  :custom
  ;; to compute blended backgrounds correctly
  (kind-icon-default-face 'corfu-default)
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

(use-package! cape
  :defer t
  :init
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-keyword)
  (add-to-list 'completion-at-point-functions #'cape-symbol)
  (add-to-list 'completion-at-point-functions #'+cape/yasnippet)
  <<tabnine>>)

;; TAB CYCLE if there are only a few candidates, otherwise show menu
(setq completion-cycle-threshold 3)
(when EMACS28+    ; Hide commands in M-x which do not apply to the current mode.
  ;; Corfu commands are hidden, since they are not supposed to be used via M-x.
  (setq read-extended-command-predicate #'command-completion-default-include-p))

;; Enable indentation+completion using the TAB key.
;; `completion-at-point' is often bound to M-TAB.
(setq tab-always-indent 'complete)

;; Dirty hack to get c completion running
;; Discussion in https://github.com/minad/corfu/issues/34
(when (equal tab-always-indent 'complete)
  (map! :map c-mode-base-map
        :i [remap c-indent-line-or-region] #'completion-at-point))
#+end_src
**** packages.el
#+begin_src emacs-lisp :tangle modules/completion/corfu/packages.el
;; -*- no-byte-compile: t; -*-
;;; completion/corfu/packages.el

(package! corfu)
(when (featurep! +orderless)
  (package! orderless))
(package! kind-icon)
(package! cape :recipe (:host github :repo "minad/cape" :branch "main"))
(unless (featurep! :completion company) (package! company))
#+end_src

*** Tabnine
+ [[https://github.com/tommyX12/company-tabnine][company-tabnine]] (=+tabnine=)

**** With Company
This configuration come as a flag but it isn't bundled with company module.
I put the flag for my convenient to enable/disable package.

Install package in =packages.el=. Enable by add flag to =:completion company=
***** Configuration code
#+begin_src emacs-lisp
;;; :completion company +tabnine
(when (featurep! :completion company +tabnine)
  (add-to-list 'company-backends #'company-tabnine)
  (after! company
    (setq +lsp-company-backends
          '(company-tabnine :separate company-capf company-yasnippet))
    (setq company-show-numbers t)
    (setq company-idle-delay 0)))
#+end_src

**** With Corfu
This configuration come as a flag and is bundled with corfu module.
Enable by add =+tabnine= flag to =:completion corfu=
***** Tabnine part in Doom's Corfu module source code
+ tabnine/
  #+name: company-tabnine
  #+begin_src org :tangle no
[[https://github.com/tommyx12/company-tabnine][company-tabnine]] (=+tabnine=)
  #+end_src
  #+name: tabnine
  #+begin_src emacs-lisp :tangle no
(when (featurep! +tabnine)
  (add-to-list 'completion-at-point-functions
               (cape-company-to-capf #'company-tabnine)))
  #+end_src
  #+name: packages.el
  #+begin_src emacs-lisp :tangle modules/completion/corfu/packages.el
(when (featurep! +tabnine)
  (package! company-tabnine
    :recipe (:host github :repo "tommyX12/company-tabnine")))
  #+end_src
*** Vertico
+ =+childframe=
  _Enable vertico-posframe extension_
  #+begin_src emacs-lisp :noweb no-export
;;; :completion vertico
(when (featurep! :completion vertico +childframe)
  (require 'vertico-posframe)
  (vertico-posframe-mode 1)
  (setq vertico-posframe-border-width 10
        vertico-posframe-parameters
        '((min-width . 90)
          <<show-fringe>>)))
  #+end_src

  _show fringe to vertico-posframe_
  #+name: show-fringe
  #+begin_src emacs-lisp :tangle no
(left-fringe  . 8)
(right-fringe . 8)
  #+end_src
** UI :ui:
*** Deft
**** Configuration
Specify the directory in which your notes are stored:

#+begin_src emacs-lisp
;;; ui: deft
(setq deft-directory "~/notes")
#+end_src
*** doom-dashboard
- *Dashboard Quick Actions*
  The config idea is come from Tecosaur's Emacs configuration.
  #+begin_quote
  When using the dashboard, there are often some actions I will take. As the
  dashboard is its own major mode, there is no need to suffer the tyranny of
  unnecessary keystrokes — we can simply bind common actions to a single key!
  #+end_quote
  #+name: dashboard
  #+begin_src emacs-lisp :tangle no
(:when (featurep! :ui doom-dashboard)
 (:map doom-leader-open-map
  "0"       #'+doom-dashboard/open)
 :map +doom-dashboard-mode-map
 :ne "h"    #'+treemacs/toggle
 :ne "l"    #'push-button
 :ne "u"    #'doom/quickload-session
 :ne "a"    #'org-agenda
 :ne "f"    #'find-file
 :ne "e"    #'eww
 :ne "r"    #'consult-recent-file
 :ne "p"    #'projectile-switch-project
 :ne "P"    #'doom/open-private-config
 :ne "c" (cmd! (find-file (expand-file-name "config.org" doom-private-dir)))
 :ne "." (defun find-dotfile () (interactive) (doom-project-find-file "~/.config"))
 :ne "b"    #'consult-buffer
 :ne "q"    #'save-buffers-kill-terminal
 :ne "v"    #'+vterm/here
 :ne "t"    #'telega
 :ne "T"    #'=twitter
 :ne "m"    #'mu4e
 :ne "n"    #'+default/find-in-notes
 :ne "d"    #'+workspace/close-window-or-workspace
 :ne "x"    #'org-capture)
  #+end_src

*** Tab-Workspaces (work in progress) :ui:tab_workspaces:
**** README.org
#+begin_src org :tangle modules/ui/tab-workspaces/README.org :mkdirp yes
,#+TITLE:   ui/tab-workspaces
,#+DATE:    November 15, 2020
,#+SINCE:   3.0
,#+STARTUP: inlineimages nofold

,* Table of Contents :TOC_3:noexport:
- [[#description][Description]]
  - [[#maintainers][Maintainers]]
  - [[#module-flags][Module Flags]]
  - [[#plugins][Plugins]]
  - [[#hacks][Hacks]]
- [[#prerequisites][Prerequisites]]
- [[#features][Features]]
- [[#configuration][Configuration]]
- [[#troubleshooting][Troubleshooting]]

,* Description

Provide persistent workspaces using Emacs 27+ tab-bar feature

,** Maintainers
+ @gagbo (Author)

,** Module Flags
This module provides no flags.

,** Plugins
+ [[https://github.com/alphapapa/burly.el][burly.el]]
+ [[https://github.com/alphapapa/bufler.el][bufler.el]]

,** Hacks
The =bufler-tabs-mode= is very carefully avoided, because it uses tabs in a way
that is not compatible with this module's goal (changing tabs should change your
window configuration entirely)

,* Prerequisites
This module has no prerequisites.

,* Features
# An in-depth list of features, how to use them, and their dependencies.

A workspace is a group of buffers sharing the same bufler-workspace (which is
the =bufler-workspace-path= buffer-local variable).

Those workspaces are shown in tabs, whose name match the
=bufler-workspace-path=

,* Configuration
# How to configure this module, including common problems and how to address them.

,* Troubleshooting
# Common issues and their solution, or places to look for help.
#+end_src
**** bindings.el
#+begin_src emacs-lisp :tangle modules/ui/tab-workspaces/bindings.el
(map!  :n "C-t"   #'+workspace/new
       :n "C-S-t" #'+workspace/display
       :g "M-1"   #'+workspace/switch-to-0
       :g "M-2"   #'+workspace/switch-to-1
       :g "M-3"   #'+workspace/switch-to-2
       :g "M-4"   #'+workspace/switch-to-3
       :g "M-5"   #'+workspace/switch-to-4
       :g "M-6"   #'+workspace/switch-to-5
       :g "M-7"   #'+workspace/switch-to-6
       :g "M-8"   #'+workspace/switch-to-7
       :g "M-9"   #'+workspace/switch-to-8
       :g "M-0"   #'+workspace/switch-to-final
       (:when IS-MAC
        :g "s-t"   #'+workspace/new
        :g "s-T"   #'+workspace/display
        :n "s-1"   #'+workspace/switch-to-0
        :n "s-2"   #'+workspace/switch-to-1
        :n "s-3"   #'+workspace/switch-to-2
        :n "s-4"   #'+workspace/switch-to-3
        :n "s-5"   #'+workspace/switch-to-4
        :n "s-6"   #'+workspace/switch-to-5
        :n "s-7"   #'+workspace/switch-to-6
        :n "s-8"   #'+workspace/switch-to-7
        :n "s-9"   #'+workspace/switch-to-8
        :n "s-0"   #'+workspace/switch-to-final))

(map! :leader
      :desc "Switch workspace buffer" "," #'persp-switch-to-buffer
      :desc "Switch buffer"           "<" #'switch-to-buffer
      (:prefix-map ("TAB" . "workspace")
       :desc "Delete this workspace"     "d"   #'+workspace/delete
       :desc "Switch workspace"          "g"   #'+workspace/switch-to
       :desc "Restore workspace"         "G"   #'+workspace/restore
       :desc "Load workspace from file"  "l"   #'+workspace/load
       :desc "New workspace"             "n"   #'+workspace/new
       :desc "Rename workspace"          "r"   #'+workspace/rename
       :desc "Restore last session"      "R"   #'+workspace/restore-last-session
       :desc "Save workspace to file"    "s"   #'+workspace/save
       :desc "Delete session"            "x"   #'+workspace/kill-session
       :desc "Display tab bar"           "TAB" #'+workspace/display
       :desc "Switch workspace"          "."   #'+workspace/switch-to
       :desc "Switch to last workspace"  "`"   #'+workspace/other
       :desc "Next workspace"            "]"   #'+workspace/switch-right
       :desc "Previous workspace"        "["   #'+workspace/switch-left
       :desc "Switch to 1st workspace"   "1"   #'+workspace/switch-to-0
       :desc "Switch to 2nd workspace"   "2"   #'+workspace/switch-to-1
       :desc "Switch to 3rd workspace"   "3"   #'+workspace/switch-to-2
       :desc "Switch to 4th workspace"   "4"   #'+workspace/switch-to-3
       :desc "Switch to 5th workspace"   "5"   #'+workspace/switch-to-4
       :desc "Switch to 6th workspace"   "6"   #'+workspace/switch-to-5
       :desc "Switch to 7th workspace"   "7"   #'+workspace/switch-to-6
       :desc "Switch to 8th workspace"   "8"   #'+workspace/switch-to-7
       :desc "Switch to 9th workspace"   "9"   #'+workspace/switch-to-8
       :desc "Switch to final workspace" "0"   #'+workspace/switch-to-final)

      (:prefix-map ("b" . "buffer")
       :desc "Switch workspace buffer" "b" #'bufler-switch-buffer
       :desc "Switch buffer"           "B" #'switch-to-buffer))
#+end_src
