config.el
      (:when (featurep! :ui doom-dashboard)
       (:map doom-leader-open-map
        "0"       #'+doom-dashboard/open)
       :map +doom-dashboard-mode-map
       :ne "h"    #'+treemacs/toggle
       :ne "l"    #'push-button
       :ne "u"    #'doom/quickload-session
       :ne "a"    #'org-agenda
       :ne "f"    #'find-file
       :ne "e"    #'eww
       :ne "r"    #'consult-recent-file
       :ne "p"    #'projectile-switch-project
       :ne "P"    #'doom/open-private-config
       :ne "c" (cmd! (find-file (expand-file-name "config.org" doom-private-dir)))
       :ne "." (defun find-dotfile () (interactive) (doom-project-find-file "~/.config"))
       :ne "b"    #'consult-buffer
       :ne "q"    #'save-buffers-kill-terminal
       :ne "v"    #'+vterm/here
       :ne "t"    #'telega
       :ne "T"    #'=twitter
       :ne "m"    #'mu4e
       :ne "n"    #'+default/find-in-notes
       :ne "d"    #'+workspace/close-window-or-workspace
       :ne "x"    #'org-capture)
