config.org
**** README.org
#+begin_src org :tangle modules/ui/fixmee/README.org :mkdirp yes
,#+TITLE:   :ui fixmee
,#+DATE:    January 23, 2022
,#+SINCE:   v3.0.0-alpha
,#+STARTUP: inlineimages nofold

,* Table of Contents :TOC_3:noexport:
- [[#description][Description]]
  - [[#maintainers][Maintainers]]
  - [[#module-flags][Module Flags]]
  - [[#plugins][Plugins]]
- [[#prerequisites][Prerequisites]]
- [[#features][Features]]
  - [[#urgency-of-fixme-notices][Urgency of "fixme" notices]]
  - [[#how-to-use-this-module][How to use this module]]
  - [[#key-bindings][Key Bindings]]
- [[#configuration][Configuration]]
- [[#troubleshooting][Troubleshooting]]

,* Description
This module tracks "fixme" notices in code comments, highlights
them, ranks them by urgency, and lets you navigate to them quickly.

,** Maintainers
+ [[https://github.com/thaenalpha][@thaenalpha]] (Author)

,** Module Flags
This module provides no flags.

,** Plugins
+ [[https://github.com/rolandwalker/fixmee][fixmee]]

,* Prerequisites
This module has no prerequisites.

,* Features
# An in-depth list of features, how to use them, and their dependencies.
,** Urgency of "fixme" notices
Is indicated by repetitions of the final character. For example,
one might write "FIXMEEEEEEEEE" for an important issue. The
~fixmee-goto-nextmost-urgent~ command will navigate to the longest notice first.

,** How to use this module
open some buffers and right-click on the word "fixme" in a comment

or press

=C-c f=

or

=M-x fixmee RET=

or

roll the mouse wheel when hovering over the text "fixm"
in the modeline.

or

execute ~fixmee-view-listing~ to navigate using
`next-error' conventions.


,** Key Bindings
| keybind     | description                                                |
|-------------+------------------------------------------------------------|
| =C-c f=     | ~fixmee-goto-nextmost-urgent~                              |
| =C-c F=     | ~fixmee-goto-prevmost-urgent~                              |
| =C-c v=     | ~fixmee-view-listing~                                      |
| =M-n=       | ~fixmee-goto-next-by-position~     only when the point is  |
| =M-p=       | ~fixmee-goto-previous-by-position~ inside a "fixme" notice |
| =C-u C-c f= | go to the nextmost urgent item in the current buffer       |
| =C-u C-c F= | go to the previousmost urgent item in the current buffer   |

,* Configuration
# How to configure this module, including common problems and how to address them.

,* Troubleshooting
# Common issues and their solution, or places to look for help.
#+end_src

**** config.el
#+begin_src emacs-lisp :tangle modules/ui/fixmee/config.el
;;; ui/fixmee/config.el -*- lexical-binding: t; -*-

(use-package! fixmee :defer t :config (global-fixmee-mode 1))
#+end_src

**** packages.el
[[file:packages.org::*Fixmee][Fixmee]]

** Editor :editor:
*** Evil :editor:evil:
#+name: evil-settings
#+begin_src emacs-lisp
;;; :editor evil
;; Focus new window after splitting
(setq evil-split-window-below t
      evil-vsplit-window-right t
      ;; By default while in insert all changes are one big blob. Be more granular
      evil-want-fine-undo t)
#+end_src
**** Change evil surround pairs alist :evil:evil_surround:behavior:

When changing surrounding pairs like from [hello-world] to (hello-world), using
a keyboard shortcut like =cs[(=, it makes more sense to assume it's formatted
correctly. Instead it will add a space after the substitute.

However This is not the case for programming modes which can auto balance space
between pairs. Thus makes you need some extra work to get rid a space with a
little effort *except* _for Org-Mode source block_.

#+begin_src emacs-lisp
(add-hook! 'evil-org-mode-hook
  (setq-local evil-surround-pairs-alist
              '((40 "(" . ")")
                (91 "[" . "]")
                (123 "{" . "}")
                (41 "(" . ")")
                (93 "[" . "]")
                (125 "{" . "}")
                (35 "#{" . "}")
                (98 "(" . ")")
                (66 "{" . "}")
                (62 "<" . ">")
                (116 . evil-surround-read-tag)
                (60 . evil-surround-read-tag)
                (102 . evil-surround-function))))
#+end_src

*** Format
**** Disabling the LSP formatter
According to [[file:~/.emacs.d/modules/editor/format/README.org::*Disabling the LSP formatter][Disabling the LSP formatter]]
#+begin_quote
If you are in a buffer with ~lsp-mode~ enabled and a server that
supports =textDocument/formatting=, it will be used instead of
=format-all='s formatter.
#+end_quote

To disable this behavior on ts and js modes in favor of prettier:
#+begin_src emacs-lisp
;;; :editor format
(setq-hook! '(js-mode
              js2-mode
              rjsx-mode
              typescript-mode
              typescript-tsx-mode) +format-with-lsp nil)
#+end_src
** emacs
*** dired
#+name: diredc
#+begin_src emacs-lisp :tangle no
(:when )
#+end_src

** Tools :tools:
*** Arrayify
#+begin_src emacs-lisp
(use-package arrayify :load-path "lisp") ; ~/.doom.d/lisp/arrayify.el
#+end_src
*** Brief :tools:
**** README.org
#+begin_src org :tangle modules/tools/brief/README.org :mkdirp yes
,#+TITLE:   tools/brief
,#+DATE:    January 13, 2022
,#+SINCE:   v3.0.0-alpha
,#+STARTUP: inlineimages nofold

,* Table of Contents :TOC_3:noexport:
- [[#description][Description]]
  - [[#maintainers][Maintainers]]
  - [[#module-flags][Module Flags]]
  - [[#plugins][Plugins]]
- [[#prerequisites][Prerequisites]]
- [[#features][Features]]
- [[#configuration][Configuration]]
- [[#troubleshooting][Troubleshooting]]

,* Description
Module for brief help

+ If possible, include a brief list of feature highlights here
+ Like code completion, syntax checking or available snippets
+ Include links to packages & external things where possible

,** Maintainers
+ [[https://github.com/thaenalpha][@thaenalpha]] (Author)

,** Module Flags
This module provides no flags.

,** Plugins
+ [[https://github.com/davep/cheat-sh.el][cheat-sh]]
+ [[https://github.com/thanhvg/emacs-howdoyou][howdoyou]]
+ [[https://github.com/kuanyui/tldr.el][tldr]]
+ [[https://github.com/astoff/devdocs.el][devdocs]]

,* Prerequisites
This module has no prerequisites.

,* Features
# An in-depth list of features, how to use them, and their dependencies.

,* Configuration
# How to configure this module, including common problems and how to address them.

,* Troubleshooting
#+end_src
**** config.el
#+begin_src emacs-lisp :tangle modules/tools/brief/config.el
;;; tools/brief/config.el -*- lexical-binding: t; -*-

(use-package! howdoyou
  :commands (howdoyou-query aj/howdoyou-hydra/body)
  :config
  (set-popup-rule! "*How Do You" :vslot 3 :size 0.5 :side 'top
    :select t :ttl nil :modeline t :autosave t :quit t)

  (add-hook! 'howdoyou-mode-hook
    (doom-mark-buffer-as-real-h) (persp-add-buffer (current-buffer))
    (solaire-mode +1) (mkdir "/tmp/howdoyou" t)
    (setq-local org-src-fontify-natively nil)
    (setq-local buffer-file-name
                "/tmp/howdoyou/latest.org")))

(map! :map search-map
      "M-a" #'howdoyou-query
      "M-s" #'cheat-sh
      "M-d" #'tldr
      "d"   (define-prefix-command 'devdocs))
#+end_src

**** packages.el
[[file:packages.org::*Brief][Brief]]

*** fzf :tools:
**** Description
Command-line fuzzy finder written in Go

***** Plugins
+ [[https://github.com/bling/fzf.el][fzf]]

**** config.el
#+begin_src emacs-lisp :tangle modules/tools/fzf/config.el :mkdirp yes
  ;;; tools/fzf/config.el -*- lexical-binding: t; -*-

(after! evil
  (evil-define-key 'insert fzf-mode-map (kbd "ESC") #'term-kill-subjob))

(define-minor-mode fzf-mode
  "Minor mode for the FZF buffer"
  :init-value nil
  :lighter " FZF"
  :keymap '(("C-c" . term-kill-subjob)))

(defadvice! doom-fzf--override-start-args-a (original-fn &rest args)
  "Set the FZF minor mode with the fzf buffer."
  :around #'fzf/start
  (message "called with args %S" args)
  (apply original-fn args)

  ;; set the FZF buffer to fzf-mode so we can hook ctrl+c
  (set-buffer "*fzf*")
  (fzf-mode))

(defvar fzf/args
  "-x --print-query -m --tiebreak=index --expect=ctrl-v,ctrl-x,ctrl-t")

(use-package! fzf
  :commands (fzf fzf-projectile fzf-hg fzf-git fzf-git-files fzf-directory
                 fzf-git-grep))
#+end_src
**** packages.el
#+begin_src emacs-lisp :tangle modules/tools/fzf/packages.el
;; -*- no-byte-compile: t; -*-
;;; tools/fzf/packages.el

(package! fzf)
#+end_src
*** magit +forge
#+name: magit-settings
#+begin_src emacs-lisp
;;; :tools magit
(setq magit-inhibit-save-previous-winconf t ; Don't restore wconf after quit magit
      forge-database-connector (when EMACS29+ 'sqlite-builtin)) ; buitin support
#+end_src

*** Tree-sitter
+ tree-sitter/
  #+name: README.org
  #+begin_src org :tangle modules/tools/tree-sitter/README.org :mkdirp yes
,#+TITLE:   tools/tree-sitter
,#+DATE:    October 26, 2020
,#+SINCE:   v3.0.0
,#+STARTUP: inlineimages nofold

,* Table of Contents :TOC_3:noexport:
- [[#description][Description]]
  - [[#maintainers][Maintainers]]
  - [[#module-flags][Module Flags]]
  - [[#plugins][Plugins]]
- [[#prerequisites][Prerequisites]]
- [[#features][Features]]
- [[#configuration][Configuration]]
  - [[#face-remapping][Face remapping]]
- [[#troubleshooting][Troubleshooting]]

,* Description
# A summary of what this module does.
=:tools tree-sitter= sets up an Emacs binding for [[https://tree-sitter.github.io/][Tree-sitter]], an incremental
parsing system.

From the [[https://ubolonton.github.io/emacs-tree-sitter/][main package author]]:
,#+begin_quote
It aims to be the foundation for a new breed of Emacs packages that understand
code structurally. For example:

- Faster, fine-grained code highlighting.
- More flexible code folding.
- Structural editing (like Paredit, or even better) for non-Lisp code.
- More informative indexing for imenu.

The author of Tree-sitter articulated its merits a lot better in this Strange Loop talk.
,#+end_quote

The [[https://www.thestrangeloop.com/2018/tree-sitter---a-new-parsing-system-for-programming-tools.html][Strange Loop talk]]

,** Maintainers
+ @gagbo (Author)

,** Module Flags
# If this module has no flags, then...
This module provides no flags.

,** Plugins
# A list of linked plugins
+ [[https://github.com/ubolonton/emacs-tree-sitter/][emacs-tree-sitter]]


,* Prerequisites
This module has no prerequisites.

,* Features
# An in-depth list of features, how to use them, and their dependencies.

,* Configuration
# How to configure this module, including common problems and how to address them.
,** Face remapping
Tree sitter provides a lot more granular and language-specific faces. If you
want to remap some of them you can either customize the
=tree-sitter-hl-face:CAPTURE-NAME= face or advice the
=tree-sitter-hl-face-mapping-function= function as in the examples in
[[https://ubolonton.github.io/emacs-tree-sitter/syntax-highlighting/customization/#face-mappings][emacs-tree-sitter docs]]

,* Troubleshooting
# Common issues and their solution, or places to look for help.
  #+end_src
  #+name: config.el
  #+begin_src emacs-lisp :tangle modules/tools/tree-sitter/config.el
;;; tools/tree-sitter/config.el -*- lexical-binding: t; -*-

;; Does deferring loading to prog-mode-hook work ?
(use-package! tree-sitter-langs)

(global-tree-sitter-mode)
(add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)
  #+end_src
  #+name: packages.el
  #+begin_src emacs-lisp :tangle modules/tools/tree-sitter/packages.el
;; -*- no-byte-compile: t; -*-
;;; tools/tree-sitter/packages.el

(package! tree-sitter)
(package! tree-sitter-langs)
  #+end_src
** Programming Language :lang:
This section adds packages and configuration on top of Doom Lang modules

*** Clojure
turn on paredit-mode (minor) after Clojure-mode was loaded (major)
#+begin_src emacs-lisp
;;; :lang clojure
(when (featurep! :lang clojure)
  (add-hook 'clojure-mode-hook #'paredit-mode))
#+end_src

*** JavaScript
**** Description
My Doom Emacs private JavaScript module with Add-on plugins.
This was made by doing relative symbolic links to Doom built-in JavaScript Module except for packages.el.

***** Plugins
#+begin_src emacs-lisp :tangle modules/lang/javascript/packages.el :mkdirp yes
;; -*- no-byte-compile: t; -*-
;;; lang/javascript/packages.el
#+end_src
[[https://github.com/defunkt/coffee-mode][coffee-mode]]
[[https://github.com/mooz/js2-mode][js2-mode]]
[[https://github.com/felipeochoa/rjsx-mode][rjsx-mode]]
[[https://github.com/emacs-typescript/typescript.el][typescript-mode]]
#+begin_src emacs-lisp :tangle modules/lang/javascript/packages.el
;; Major modes
(package! rjsx-mode :built-in 'prefer)
(package! typescript-mode :built-in 'prefer)
#+end_src
[[https://github.com/magnars/js2-refactor.el][js2-refactor]]
[[https://github.com/mojochao/npm-mode][npm-mode]]
+ [[https://github.com/rajasegar/pnpm-mode][pnpm-mode]]
+ [[https://github.com/Galooshi/emacs-import-js][import-js]]
#+begin_src emacs-lisp :tangle modules/lang/javascript/packages.el
;; Tools
(package! js2-refactor :built-in 'prefer)
(package! npm-mode :built-in 'prefer)
(package! add-node-modules-path :built-in 'prefer)
(package! pnpm-mode)
(package! import-js)
(package! yarn
  :recipe (:host github :repo "thaenalpha/yarn.el"))
#+end_src
[[https://github.com/abicky/nodejs-repl.el][nodejs-repl]]
[[https://github.com/skeeto/skewer-mode][skewer-mode]]
#+begin_src emacs-lisp :tangle modules/lang/javascript/packages.el
;; Eval
(package! nodejs-repl :built-in 'prefer)
(package! skewer-mode :built-in 'prefer)
#+end_src
[[https://github.com/ananthakumaran/tide][tide]]
[[https://github.com/NicolasPetton/xref-js2][xref-js2]]*
#+begin_src emacs-lisp :tangle modules/lang/javascript/packages.el
;; Programming environment
(package! tide :built-in 'prefer)
(when (featurep! :tools lookup)
  (package! xref-js2 :built-in 'prefer))
#+end_src

***** Appendix
| symbolic    | description   |
|-------------+---------------|
| =PACKAGE=   | Doom original |
| =+ PACKAGE= | Add-on plugin |

