config.org
**** New features
+ automatically import dependencies in your JavaScript project.
+ Minor mode for working with pnpm projects
+ Minor mode for working with yarn projects

**** Prerequisites for
***** This module
You must open this doc in Emacs and run this code block by press enter:
(this works only if your Emacs and Doom configs path are defaults)
#+begin_src sh :tangle no
ln -s ../../../../.emacs.d/modules/lang/javascript/README.org modules/lang/javascript/README.org
ln -s ../../../../.emacs.d/modules/lang/javascript/autoload.el modules/lang/javascript/autoload.el
ln -s ../../../../.emacs.d/modules/lang/javascript/config.el modules/lang/javascript/config.el
ln -s ../../../../.emacs.d/modules/lang/javascript/doctor.el modules/lang/javascript/doctor.el
#+end_src
***** Running ImportJS in Emacs
1. Install the importjs binary:
   #+begin_src sh :dir /sudo:: :tangle no
sudo npm install import-js -g
   #+end_src
2. Configure Import-Js
3. Install Watchman as an performance booster to import-js daemon
   - macOS or Linux
     #+begin_src sh :tangle no
brew update && brew install watchman
     #+end_src

**** Configuration
These configs live inside the =+config.el= file and some are located in
=autoload/*.el= files.

As the =+config.el= is an [[file:~/.emacs.d/docs/getting_started.org::*Additional files][Additional file]],
This can be loaded with the ~load!~ macro, which will load an elisp file
relative to the file it's used from which is =init.el= in our case.

#+BEGIN_SRC emacs-lisp :tangle modules/lang/javascript/init.el
;; Omitting the file extension allows Emacs to load the byte-compiled version,
;; if it is available:
(load! "+config")
#+END_SRC
***** import-js
1. Run the import-js daemon
   * =M-x=  ~run-import-js~
   * The daemon will use watchman if installed to improve performance
   * Configure ~run-import-js~ to run on open a JavaScript oriented buffer:

     #+begin_src emacs-lisp :tangle modules/lang/javascript/+config.el
;;; lang/javascript/+config.el -*- lexical-binding: t; -*-
;;
;;; Tools

(add-hook! '(typescript-mode-local-vars-hook
             typescript-tsx-mode-local-vars-hook
             web-mode-local-vars-hook
             rjsx-mode-local-vars-hook)
  (defun import-js-setup ()
    "Start `import-js' in the current buffer."
    (let ((buffer-file-name (buffer-file-name (buffer-base-buffer))))
      (when (derived-mode-p 'js-mode 'typescript-mode 'typescript-tsx-mode)
        (if (null buffer-file-name)
            ;; necessary because `tide-setup' and `lsp' will error if not a
            ;; file-visiting buffer
            (add-hook 'after-save-hook #'import-js-setup
                      nil 'local)
          (if (executable-find "node")
              (and (require 'import-js nil t)
                   (progn (import-js-mode 1) (run-import-js) import-js-mode))
            (ignore
             (doom-log
              "Couldn't start the import-js daemon because 'node' is missing")))
          (remove-hook 'after-save-hook #'import-js-setup
                       'local))))))
     #+end_src
2. Import a file!
   * You can use something like =M-x=  ~import-js-import~ with your cursor over
     the desired module
   * It will be helpful to bind ~import-js-import~ to an easy-to-use binding,
     such as:

     #+begin_src emacs-lisp :tangle modules/lang/javascript/autoload/import-js.el :mkdirp yes :noweb no-export
;;; lang/javascript/autoload/import-js.el -*- lexical-binding: t; -*-

(defvar import-js-map (make-sparse-keymap) "Keymap for `import-js'.")
(map! (:map import-js-map
       <<import-js-goto>>
       "C-c i" (define-prefix-command 'import-js)
       :localleader "i" #'import-js)
      (:map import-js
       "f" #'import-js-fix
       "g" #'import-js-goto
       "i" #'import-js-import
       "k" #'kill-import-js
       "r" #'run-import-js))
     #+end_src
3. Go directly to a file
   * The ImportJS goto interface allows us to jump to a package
   * =M-x=  ~import-js-goto~ will jump to the appropriate file found by ImportJS
   * This should also be bound to something useful
     #+name: import-js-goto
     #+begin_src emacs-lisp :tangle no
:nv "g <f4>" #'import-js-goto
     #+end_src
4. Fix your imports
   * Optionally, you can configure ImportJS to fix your imports for you, adding unknown variables and removing unused imports. ImportJS uses eslint to find these variables.
   * `eslint` must be in your PATH.
   * eslint plugins must be installed for that specific version of eslint (if
     eslint is a global eslint, you may need to install the plugins globally)
   * Run with =M-x=  ~import-js-fix~
   * Configure ~import-js-fix~ to run on save:

     #+begin_src emacs-lisp :tangle modules/lang/javascript/autoload/import-js.el
 ;;;###autoload
(define-minor-mode import-js-mode
  "Minor mode for automatically Import Javascript dependencies."
  :lighter " importjs"
  :keymap import-js-map
  (if import-js-mode
      (add-hook 'after-save-hook #'import-js-fix nil t)
    (remove-hook 'after-save-hook #'import-js-fix t)))

;; Hooks

 ;;;###autoload
(defun +javascript-cleanup-import-js-processes-h ()
  "Clean up dangling import-js daemon process if there are no more buffers with `import-js-mode' active."
  (when import-js-mode
    (unless (cl-loop for buf in (delq (current-buffer) (buffer-list))
                     if (buffer-local-value 'import-js-mode buf)
                     return buf)
      (kill-import-js))))
     #+end_src
5. Cleanup importjsd process when no import-js buffers are left

   #+begin_src emacs-lisp :tangle modules/lang/javascript/+config.el
;;;###package import-js
(use-package! import-js
  :config
  (add-hook! 'import-js-mode-hook
    (add-hook 'kill-buffer-hook #'+javascript-cleanup-import-js-processes-h
              nil 'local)))
   #+end_src

***** pnpm-mode
#+begin_src emacs-lisp :tangle modules/lang/javascript/+config.el
;;;###package pnpm-mode
(use-package! pnpm-mode
  :config
  (map! :localleader
        :map pnpm-mode-keymap
        "n" pnpm-mode-command-keymap)
  ;; Disable npm-mode when enabling pnpm
  (add-hook 'pnpm-mode-hook
            (defun turn-off-npm-mode () (npm-mode -1))))
#+end_src
****** Project Activation
By adding =.dir-locals.el= file on the root directory of a project containing:
#+begin_src emacs-lisp :tangle no
((nil . ((mode . pnpm))))
#+end_src
******* For more detail: [[https://github.com/rajasegar/pnpm-mode#project-activation][rajasegar/pnpm-mode: An Emacs minor mode for working with NPM projects.]]
Captured On: [2021-10-21 Thu 15:08]

***** yarn
****** keyboard bindings

This package doesn't provide keyboard bindings, so, I have to add them to my own module scripts.

#+begin_src emacs-lisp :tangle modules/lang/javascript/autoload/yarn.el :mkdirp yes
;;; lang/javascript/autoload/yarn.el -*- lexical-binding: t; -*-

(defvar yarn--project-file-name "package.json"
  "The name of yarn project files.")

(defun yarn--project-file ()
  "Return path to the project file, or nil.
If project file exists in the current working directory, or a
parent directory recursively, return its path.  Otherwise, return
nil."
  (let ((dir (locate-dominating-file default-directory yarn--project-file-name)))
    (unless dir
      (error (concat "Error: cannot find " yarn--project-file-name)))
    (concat dir yarn--project-file-name)))

(defun yarn--get-project-property (prop)
  "Get the given PROP from the current project file."
  (let* ((project-file (yarn--project-file))
         (json-object-type 'hash-table)
         (json-contents (with-temp-buffer
                          (insert-file-contents project-file)
                          (buffer-string)))
         (json-hash (json-read-from-string json-contents))
         (value (gethash prop json-hash))
         (commands (list)))
    (cond ((hash-table-p value)
           (maphash (lambda (key value)
                      (setq commands
                            (append commands
                                    (list (list key (format "%s %s" "yarn" key))))))
                    value)
           commands)
          (t value))))

(defun yarn--exec-process (cmd &optional comint)
  "Execute a process running CMD.
Optional argument COMINT ."
  (let ((compilation-buffer-name-function
         (lambda (mode)
           (format "*yarn:%s - %s*"
                   (yarn--get-project-property "name") cmd))))
    (message (concat "Running " cmd))
    (compile cmd comint)))

(defun yarn-list ()
  "Run the 'yarn list' command."
  (interactive)
  (yarn--exec-process "yarn list --depth=0"))

(defun yarn-visit-project-file ()
  "Visit the project file."
  (interactive)
  (find-file (yarn--project-file)))

(defvar yarn-map (make-sparse-keymap)
  "Keymap for the `Yarn' package manager.")
(map! (:map yarn-map
       "C-c n" (define-prefix-command 'yarn)
       (:localleader "n" #'yarn))
      (:map yarn
       "i" #'yarn-install
       "n" #'yarn-init
       "a" #'yarn-add
       "d" #'yarn-add-dev
       "r" #'yarn-run
       "p" #'yarn-publish
       "t" #'yarn-test
       "v" #'yarn-visit-project-file
       "V" #'yarn-version
       "g" #'yarn-upgrade
       "u" #'yarn-update
       "U" #'yarn-remove
       "l" #'yarn-list))

;;;###autoload
(define-minor-mode yarn-mode
  "Minor mode for working with yarn projects."
  :lighter " yarn"
  :keymap yarn-map
  :group 'yarn)

;;;###autoload
(define-globalized-minor-mode yarn-global-mode
  yarn-mode
  yarn-mode)
#+end_src
#+begin_src emacs-lisp :tangle modules/lang/javascript/+config.el
;;;###package yarn
(use-package! yarn
  :config
  ;; Disable npm-mode when enabling yarn-mode
  (add-hook 'yarn-mode-hook #'turn-off-npm-mode))
#+end_src

****** Project Activation
By adding =.dir-locals.el= file on the root directory of a project containing:
#+begin_src emacs-lisp :tangle no
((nil . ((mode . yarn))))
#+end_src
******* For more detail: [[https://github.com/rajasegar/pnpm-mode#project-activation][rajasegar/pnpm-mode: An Emacs minor mode for working with NPM projects.]]
Captured On: [2021-10-21 Thu 15:08]

**** Troubleshooting
***** TODO import-js-daemon not running
After you M-x ~run-import-js~ command if there is an error about void symbol definition.
This likely your import-js npm installation is not succeed. You can test by running:
#+begin_src sh :tangle no
importjsd start
#+end_src
If it succeed it will return this
#+RESULTS:
: ImportJS (v4.0.2) DAEMON active. Logs will go to: /tmp/importjs.log

If not it will throw an error, the one I got is about it cannot find node_sqlite3 module.
This case is come from =node-pre-gyp= cannot find the a pre-compiled binary in the first place.
Then it uses `node-gyp` to build the extension but it failed without messages you anything.

*** Web
+ Tailwind LSP :+tailwind:
  #+begin_comment
  This sub-tree was taken from Jay Zawrotny's Doom Configures
  [[https://github.com/eccentric-j/dotfiles/blob/master/doom.d/config.org][dotfiles/config.org at master · eccentric-j/dotfiles · GitHub]]
  #+end_comment

  Provide tailwind class name completions as an extra LSP package.

  Install the lsp-tailwindcss emacs package: [[file:packages.org::*Packages in Use][Packages in Use]]

  Set add-on mode. This ensures both tailwind-lsp and the js or ts lsp servers
  run in parallel. Set ~lsp-tailwindcss-add-on-mode~ before the package loads.

  #+begin_src emacs-lisp
;;; :lang web
(use-package! lsp-tailwindcss
  :when (and (featurep! :tools lsp) (featurep! :lang web +tailwind))
  :init
  (setq lsp-tailwindcss-add-on-mode t
        lsp-tailwindcss-major-modes '(rjsx-mode web-mode html-mode css-mode
                                                typescript-mode typescript-tsx-mode)))
  #+end_src

  Lastly associate various template language files with html so that
  lsp-tailwindcss runs when editing .liquid files for example.

  #+begin_src emacs-lisp
(add-to-list 'lsp-language-id-configuration '(".*\\.liquid" . "html"))
  #+end_src

  Make sure to add the =+tailwind= flag to the =:lang web= module in [[./init.el][init.el]]!
