config.org
*** Org-mode :lang:org:
- _Configuration_

  Put any basic configuration here

  #+begin_src emacs-lisp
;;; :lang org
(setq org-clock-sound "/mnt/c/Windows/Media/Alarm06.wav"
      org-support-shift-select t
      ;; use g{h,j,k} to traverse headings and TAB to toggle their visibility,
      ;; and leave C-left/C-right to .
      org-tree-slide-skip-outline-level 2
      org-startup-with-inline-images t)
  #+end_src

- _org hide emphasis markers_
  Doom Emacs already has set to hide emphasis markers in the org-tree-slide-mode.
  This is just good to known for hiding/showing its.

  #+begin_src emacs-lisp :tangle no
(defun org-toggle-emphasis ()
  "Toggle hiding/showing of org emphasis markers."
  (interactive)
  (if org-hide-emphasis-markers
      (setq org-hide-emphasis-markers nil)
    (setq org-hide-emphasis-markers t)))

(map! :map org-mode-map "C-c e" #'org-toggle-emphasis)
  #+end_src

  [[https://www.youtube.com/watch?v=zI0BvRSbcM8][Source]]

- _Org Capture from Web browser_

  To let this configuration works, =Org Capture= browser's extension and
  =org-protocol= handler is required.

  If you're a WSL user, you can run the one that matches how your emacs launches:
  #+begin_src sh :tangle no
powershell.exe ./org-protocol.reg
  #+end_src
  #+begin_src sh :tangle no
powershell.exe ./org-protocol-omz-emacs-plugin.reg
  #+end_src

  #+begin_src conf :tangle org-protocol.reg :tangle-mode (identity #o777)
REGEDIT4

[HKEY_CLASSES_ROOT\org-protocol]
@="URL:Org Protocol"
"URL Protocol"=""
[HKEY_CLASSES_ROOT\org-protocol\shell]
[HKEY_CLASSES_ROOT\org-protocol\shell\open]
[HKEY_CLASSES_ROOT\org-protocol\shell\open\command]
@="\"C:\\Windows\\System32\\wsl.exe\" emacsclient \"%1\""
  #+end_src
  #+begin_src conf :tangle org-protocol-omz-emacs-plugin.reg :tangle-mode (identity #o777)
REGEDIT4

[HKEY_CLASSES_ROOT\org-protocol]
@="URL:Org Protocol"
"URL Protocol"=""
[HKEY_CLASSES_ROOT\org-protocol\shell]
[HKEY_CLASSES_ROOT\org-protocol\shell\open]
[HKEY_CLASSES_ROOT\org-protocol\shell\open\command]
@="\"C:\\Windows\\System32\\wsl.exe\" zsh -l ~/.oh-my-zsh/plugins/emacs/emacsclient.sh --no-wait \"%1\""
  #+end_src

  Then set keys for =Selected Template= and =Unselected Template= in extension
  options to P&L to match with org-capture-templates for =org-protocol= set below.

  #+name: Capture templates
  #+begin_src emacs-lisp
(defun transform-square-brackets-to-round-ones(string-to-transform)
  "Transforms [ into ( and ] into ), other chars left unchanged."
  (concat
   (mapcar #'(lambda (c) (if (equal c ?\[) ?\( (if (equal c ?\]) ?\) c)))
           string-to-transform)))

(require 'org-protocol)
(setq org-capture-templates
      (append
       org-capture-templates
       `(("P" "Protocol" entry
          (file+headline +org-capture-notes-file "Inbox")
          "* %^{Title}\nSource: %u, %c\n #+BEGIN_QUOTE\n%i\n#+END_QUOTE\n\n\n%?")
         ("L" "Protocol Link" entry
          (file+headline +org-capture-notes-file "Inbox")
          "* %? [[%:link][%(transform-square-brackets-to-round-ones
                          \"%:description\")]] \nCaptured On: %U")
         ("l" "Web site" entry
          (file+headline "webnotes.org" "Inbox")
          "* %a\nCaptured On: %U\nWebsite: %l\n\n%i\n%?")
         ("m" "meetup" entry (file "~/org/caldav.org")
          "* %?%:description \n%i\n%l")
         ("w" "Web site" entry
          (file+olp "~/org/inbox.org" "Web")
          "* %c :website:\n%U %?%:initial"))))
  #+end_src
  #+name: Org-roam roam-ref templates
  #+begin_src emacs-lisp
(setq  org-roam-capture-ref-templates
       '(("l" "Web site" plain (function org-roam-capture--get-point)
          "${body}\n%?"
          :file-name "%<%Y%m%d>-${slug}"
          :head "#+title: ${title}\n#+CREATED: %U\n#+roam_key: ${ref}\n\n"
          :unnarrowed t)))
  #+end_src

** Email :email: :email:
*** mu4e

This is my personal configuration.

I use =msmtp= to send mail:
#+begin_src emacs-lisp :noweb no-export
;;; :email mu4e
(after! mu4e
  (setq sendmail-program (executable-find "msmtp")
        send-mail-function #'smtpmail-send-it
        message-send-mail-function #'message-send-mail-with-sendmail
        message-sendmail-f-is-evil t
        message-sendmail-extra-arguments '("--read-envelope-from")
        <<mu4e-policies>>
        mu4e-maildir-shortcuts '(("/thaenalpha@gmail.com/Job Applying".?j)))
  <<mu4e-email-accounts>>
  (mapc
   (lambda (bookmark) (add-to-list 'mu4e-bookmarks bookmark))
   `(     ; create bookmarks to show merged views of folders across accounts:
     <<mu4e-bookmarks>>)))
#+end_src

I have multiple email addresses set like these

#+name: mu4e-email-accounts
#+BEGIN_SRC emacs-lisp :tangle no
;; Each path is relative to the path of the maildir you passed to mu
(set-email-account!
 "boliden@gmail.com"
 '((mu4e-sent-folder       . "/boliden@gmail.com/[Gmail]/Sent Mail")
   (mu4e-drafts-folder     . "/boliden@gmail.com/[Gmail]/Drafts")
   (mu4e-spam-folder       . "/boliden@gmail.com/[Gmail]/Spam")
   (mu4e-trash-folder      . "/boliden@gmail.com/[Gmail]/Trash")
   (mu4e-refile-folder     . "/boliden@gmail.com/[Gmail]/All Mail")
   (smtpmail-smtp-user     . "boliden@gmail.com")
   (mu4e-compose-signature . "---\nNopanun Laochunhanun"))
 t)
(set-email-account!
 "thaenalpha@gmail.com"
 '((mu4e-sent-folder       . "/thaenalpha@gmail.com/[Gmail]/Sent Mail")
   (mu4e-drafts-folder     . "/thaenalpha@gmail.com/[Gmail]/Drafts")
   (mu4e-spam-folder       . "/thaenalpha@gmail.com/[Gmail]/Spam")
   (mu4e-trash-folder      . "/thaenalpha@gmail.com/[Gmail]/Trash")
   (mu4e-refile-folder     . "/thaenalpha@gmail.com/[Gmail]/All Mail")
   (smtpmail-smtp-user     . "thaenalpha@gmail.com")
   (mu4e-compose-signature . "---\nNopanun Laochunhanun"))
 t)
(set-email-account!
 "bolidenx@hotmail.com"
 '((mu4e-sent-folder       . "/bolidenx@hotmail.com/Sent")
   (mu4e-drafts-folder     . "/bolidenx@hotmail.com/Drafts")
   (mu4e-spam-folder       . "/bolidenx@hotmail.com/Junk")
   (mu4e-trash-folder      . "/bolidenx@hotmail.com/Deleted")
   (mu4e-refile-folder     . "/bolidenx@hotmail.com/Archive")
   (smtpmail-smtp-user     . "bolidenx@hotmail.com")
   (mu4e-compose-signature . "---\nNopanun Laochunhanun"))
 t)
(set-email-account!
 "nopanun@live.com"
 '((mu4e-sent-folder       . "/nopanun@live.com/Sent")
   (mu4e-drafts-folder     . "/nopanun@live.com/Drafts")
   (mu4e-spam-folder       . "/nopanun@live.com/Junk")
   (mu4e-trash-folder      . "/nopanun@live.com/Deleted")
   (mu4e-refile-folder     . "/nopanun@live.com/Archive")
   (smtpmail-smtp-user     . "nopanun@live.com")
   (mu4e-compose-signature . "---\nNopanun Laochunhanun"))
 t)
(set-email-account!
 "tannarin26@yahoo.com"
 '((mu4e-sent-folder       . "/tannarin26@yahoo.com/Sent")
   (mu4e-drafts-folder     . "/tannarin26@yahoo.com/Draft")
   (mu4e-spam-folder       . "/tannarin26@yahoo.com/Bulk Mail")
   (mu4e-trash-folder      . "/tannarin26@yahoo.com/Trash")
   (mu4e-refile-folder     . "/tannarin26@yahoo.com/Archive")
   (smtpmail-smtp-user     . "tannarin26@yahoo.com")
   (mu4e-compose-signature . "---\nNopanun Laochunhanun"))
 t)
#+END_SRC

Change context behavior when opening mu4e and composing email with:
~mu4e-context-policy~ and ~mu4e-compose-context-policy~

#+name: mu4e-policies
#+begin_src emacs-lisp :tangle no
mu4e-context-policy         'ask-if-none
mu4e-compose-context-policy 'always-ask
#+end_src

*How to use contexts*

Examples:

- Compose new mail in a context
- Archive a message in a context (show which folder it goes to)
- Reply to a message in a merged search

You can create bookmarks to show merged views of folders across accounts:

#+name: mu4e-bookmarks
#+begin_src emacs-lisp :tangle no
(,(concat
   "m:/boliden@gmail.com/INBOX or m:/bolidenx@hotmail.com/Inbox or "
   "m:/nopanun@live.com/Inbox or m:/tannarin26@yahoo.com/Inbox or "
   "m:/thaenalpha@gmail.com/INBOX or m:/nopanun@live.com/IT Demands")
 "All Inboxes" ?i)
(,(concat
   "m:/boliden@gmail.com/[Gmail]/Sent Mail or m:/bolidenx@hotmail.com/Sent "
   "m:/thaenalpha@gmail.com/[Gmail]/Sent Mail or m:/nopanun@live.com/Sent or"
   " m:/tannarin26@yahoo.com/Sent") "All Sent" ?s)
(,(concat
   "m:/boliden@gmail.com/[Gmail]/Drafts or m:/bolidenx@hotmail.com/Drafts "
   "m:/thaenalpha@gmail.com/[Gmail]/Drafts or m:/nopanun@live.com/Drafts or "
   "m:/tannarin26@yahoo.com/Draft") "All Drafts" ?d)
(,(concat
   "m:/boliden@gmail.com/[Gmail]/All Mail or m:/bolidenx@hotmail.com/Archive"
   " m:/thaenalpha@gmail.com/[Gmail]/All Mail or m:/nopanun@live.com/Archive"
   " or m:/tannarin26@yahoo.com/Archive") "All Archives" ?a)
(,(concat
   "m:/boliden@gmail.com/[Gmail]/Spam or m:/bolidenx@hotmail.com/Junk or "
   "m:/thaenalpha@gmail.com/[Gmail]/Spam or m:/nopanun@live.com/Junk or "
   "m:/tannarin26@yahoo.com/Bulk Mail") "All Spams" ?p)
(,(concat
   "m:/boliden@gmail.com/[Gmail]/Trash or m:/bolidenx@hotmail.com/Deleted or"
   " m:/thaenalpha@gmail.com/[Gmail]/Trash or m:/nopanun@live.com/Deleted or"
   " m:/tannarin26@yahoo.com/Trash") "All Trashes" ?t)
#+end_src

This is your e-mail client to build!

** Apps :app:
*** Edit-Server
