config.el
(setq org-clock-sound "/mnt/c/Windows/Media/Alarm06.wav"
      org-support-shift-select t
      ;; use g{h,j,k} to traverse headings and TAB to toggle their visibility,
      ;; and leave C-left/C-right to .
      org-tree-slide-skip-outline-level 2
      org-startup-with-inline-images t)

(defun transform-square-brackets-to-round-ones(string-to-transform)
  "Transforms [ into ( and ] into ), other chars left unchanged."
  (concat
   (mapcar #'(lambda (c) (if (equal c ?\[) ?\( (if (equal c ?\]) ?\) c)))
           string-to-transform)))

(require 'org-protocol)
(setq org-capture-templates
      (append
       org-capture-templates
       `(("P" "Protocol" entry
          (file+headline +org-capture-notes-file "Inbox")
          "* %^{Title}\nSource: %u, %c\n #+BEGIN_QUOTE\n%i\n#+END_QUOTE\n\n\n%?")
         ("L" "Protocol Link" entry
          (file+headline +org-capture-notes-file "Inbox")
          "* %? [[%:link][%(transform-square-brackets-to-round-ones
                          \"%:description\")]] \nCaptured On: %U")
         ("l" "Web site" entry
          (file+headline "webnotes.org" "Inbox")
          "* %a\nCaptured On: %U\nWebsite: %l\n\n%i\n%?")
         ("m" "meetup" entry (file "~/org/caldav.org")
          "* %?%:description \n%i\n%l")
         ("w" "Web site" entry
          (file+olp "~/org/inbox.org" "Web")
          "* %c :website:\n%U %?%:initial"))))

(setq  org-roam-capture-ref-templates
       '(("l" "Web site" plain (function org-roam-capture--get-point)
          "${body}\n%?"
          :file-name "%<%Y%m%d>-${slug}"
          :head "#+title: ${title}\n#+CREATED: %U\n#+roam_key: ${ref}\n\n"
          :unnarrowed t)))

;;; :email mu4e
(after! mu4e
  (setq sendmail-program (executable-find "msmtp")
        send-mail-function #'smtpmail-send-it
        message-send-mail-function #'message-send-mail-with-sendmail
        message-sendmail-f-is-evil t
        message-sendmail-extra-arguments '("--read-envelope-from")
        mu4e-context-policy         'ask-if-none
        mu4e-compose-context-policy 'always-ask
        mu4e-maildir-shortcuts '(("/thaenalpha@gmail.com/Job Applying".?j)))
  ;; Each path is relative to the path of the maildir you passed to mu
  (set-email-account!
   "boliden@gmail.com"
   '((mu4e-sent-folder       . "/boliden@gmail.com/[Gmail]/Sent Mail")
     (mu4e-drafts-folder     . "/boliden@gmail.com/[Gmail]/Drafts")
     (mu4e-spam-folder       . "/boliden@gmail.com/[Gmail]/Spam")
     (mu4e-trash-folder      . "/boliden@gmail.com/[Gmail]/Trash")
     (mu4e-refile-folder     . "/boliden@gmail.com/[Gmail]/All Mail")
     (smtpmail-smtp-user     . "boliden@gmail.com")
     (mu4e-compose-signature . "---\nNopanun Laochunhanun"))
   t)
  (set-email-account!
   "thaenalpha@gmail.com"
   '((mu4e-sent-folder       . "/thaenalpha@gmail.com/[Gmail]/Sent Mail")
     (mu4e-drafts-folder     . "/thaenalpha@gmail.com/[Gmail]/Drafts")
     (mu4e-spam-folder       . "/thaenalpha@gmail.com/[Gmail]/Spam")
     (mu4e-trash-folder      . "/thaenalpha@gmail.com/[Gmail]/Trash")
     (mu4e-refile-folder     . "/thaenalpha@gmail.com/[Gmail]/All Mail")
     (smtpmail-smtp-user     . "thaenalpha@gmail.com")
     (mu4e-compose-signature . "---\nNopanun Laochunhanun"))
   t)
  (set-email-account!
   "bolidenx@hotmail.com"
   '((mu4e-sent-folder       . "/bolidenx@hotmail.com/Sent")
     (mu4e-drafts-folder     . "/bolidenx@hotmail.com/Drafts")
     (mu4e-spam-folder       . "/bolidenx@hotmail.com/Junk")
     (mu4e-trash-folder      . "/bolidenx@hotmail.com/Deleted")
     (mu4e-refile-folder     . "/bolidenx@hotmail.com/Archive")
     (smtpmail-smtp-user     . "bolidenx@hotmail.com")
     (mu4e-compose-signature . "---\nNopanun Laochunhanun"))
   t)
  (set-email-account!
   "nopanun@live.com"
   '((mu4e-sent-folder       . "/nopanun@live.com/Sent")
     (mu4e-drafts-folder     . "/nopanun@live.com/Drafts")
     (mu4e-spam-folder       . "/nopanun@live.com/Junk")
     (mu4e-trash-folder      . "/nopanun@live.com/Deleted")
     (mu4e-refile-folder     . "/nopanun@live.com/Archive")
     (smtpmail-smtp-user     . "nopanun@live.com")
     (mu4e-compose-signature . "---\nNopanun Laochunhanun"))
   t)
  (set-email-account!
   "tannarin26@yahoo.com"
   '((mu4e-sent-folder       . "/tannarin26@yahoo.com/Sent")
     (mu4e-drafts-folder     . "/tannarin26@yahoo.com/Draft")
     (mu4e-spam-folder       . "/tannarin26@yahoo.com/Bulk Mail")
     (mu4e-trash-folder      . "/tannarin26@yahoo.com/Trash")
     (mu4e-refile-folder     . "/tannarin26@yahoo.com/Archive")
     (smtpmail-smtp-user     . "tannarin26@yahoo.com")
     (mu4e-compose-signature . "---\nNopanun Laochunhanun"))
   t)
  (mapc
   (lambda (bookmark) (add-to-list 'mu4e-bookmarks bookmark))
   `(     ; create bookmarks to show merged views of folders across accounts:
     (,(concat
        "m:/boliden@gmail.com/INBOX or m:/bolidenx@hotmail.com/Inbox or "
        "m:/nopanun@live.com/Inbox or m:/tannarin26@yahoo.com/Inbox or "
        "m:/thaenalpha@gmail.com/INBOX or m:/nopanun@live.com/IT Demands")
      "All Inboxes" ?i)
     (,(concat
        "m:/boliden@gmail.com/[Gmail]/Sent Mail or m:/bolidenx@hotmail.com/Sent "
        "m:/thaenalpha@gmail.com/[Gmail]/Sent Mail or m:/nopanun@live.com/Sent or"
        " m:/tannarin26@yahoo.com/Sent") "All Sent" ?s)
     (,(concat
        "m:/boliden@gmail.com/[Gmail]/Drafts or m:/bolidenx@hotmail.com/Drafts "
        "m:/thaenalpha@gmail.com/[Gmail]/Drafts or m:/nopanun@live.com/Drafts or "
        "m:/tannarin26@yahoo.com/Draft") "All Drafts" ?d)
     (,(concat
        "m:/boliden@gmail.com/[Gmail]/All Mail or m:/bolidenx@hotmail.com/Archive"
        " m:/thaenalpha@gmail.com/[Gmail]/All Mail or m:/nopanun@live.com/Archive"
        " or m:/tannarin26@yahoo.com/Archive") "All Archives" ?a)
     (,(concat
        "m:/boliden@gmail.com/[Gmail]/Spam or m:/bolidenx@hotmail.com/Junk or "
        "m:/thaenalpha@gmail.com/[Gmail]/Spam or m:/nopanun@live.com/Junk or "
        "m:/tannarin26@yahoo.com/Bulk Mail") "All Spams" ?p)
     (,(concat
        "m:/boliden@gmail.com/[Gmail]/Trash or m:/bolidenx@hotmail.com/Deleted or"
        " m:/thaenalpha@gmail.com/[Gmail]/Trash or m:/nopanun@live.com/Deleted or"
        " m:/tannarin26@yahoo.com/Trash") "All Trashes" ?t))))

;;; :term vterm
