config.org
**** README.org
#+begin_src org :tangle no
,#+TITLE:   app/edit-server
,#+DATE:    January 13, 2022
,#+SINCE:   v3.0.0-alpha
,#+STARTUP: inlineimages nofold

,* Table of Contents :TOC_3:noexport:
- [[#description][Description]]
  - [[#maintainers][Maintainers]]
  - [[#module-flags][Module Flags]]
  - [[#plugins][Plugins]]
- [[#prerequisites][Prerequisites]]
- [[#features][Features]]
- [[#configuration][Configuration]]
- [[#troubleshooting][Troubleshooting]]

,* Description
Server that responds to edit requests from Chrome or Firefox

,** Maintainers
+ [[https://github.com/thaenalpha][@thaenalpha]] (Author)

,** Module Flags
This module provides no flags.

,** Plugins
+ [[https://github.com/stsquad/emacs_chrome][edit-server]]

,* Prerequisites
Install dependency: Edit with Emacs Chrome/Firefox extension
[[https://github.com/stsquad/emacs_chrome][stsquad/emacs_chrome: A Chromium "clone" of It's All Text for spawni...]]

,* Features
# An in-depth list of features, how to use them, and their dependencies.

,* Configuration
Set major mode for each site.

,* Troubleshooting
# Common issues and their solution, or places to look for help.

#+end_src
**** config.el
#+begin_src emacs-lisp :tangle modules/app/edit-server/config.el
;;; app/edit-server/config.el -*- lexical-binding: t; -*-

(use-package! edit-server
  :commands edit-server-start
  :init (edit-server-start)
  :config (setq edit-server-new-frame-alist
                '((name . "Edit with Emacs FRAME")
                  (top . 200)
                  (left . 200)
                  (width . 80)
                  (height . 25)
                  (minibuffer . t)
                  (menu-bar-lines . t)
                  (window-system . x)))
  (setq edit-server-url-major-mode-alist
        '(("github\\.com" . markdown-mode))))
#+end_src
**** packages.el
Installing edit-server from MELPA

+ ~install~ as a doom :app module (You need to add =edit-server= at :app in =init.el=)

#+begin_src emacs-lisp :tangle modules/app/edit-server/packages.el
;; -*- no-byte-compile: t; -*-
;;; app/edit-server/packages.el

(package! edit-server)
#+end_src

- ~uninstall~ by replace =:tangle= value in ~install~ block with =no= and just press enter at the block below:
  #+begin_src sh :tangle no
rm -r modules/app/edit-server
  #+end_src

*** Mastodon :social:microblogging:
**** README.org
#+begin_src org :tangle modules/app/mastodon/README.org :mkdirp yes
,#+TITLE:   app/mastodon
,#+DATE:    January 13, 2022
,#+SINCE:   v3.0.0-alpha
,#+STARTUP: inlineimages nofold

,* Table of Contents :TOC_3:noexport:

,* Description
Enjoy Mastodon from emacs.

+

,** Maintainers
+ [[https://github.com/thaenalpha][@thaenalpha]] (Author)

,** Module Flags
This module provides no flags.

,** Plugins
+ [[https://git.blast.noho.st/mouse/mastodon.el][mastodon]]

,** Hacks
# A list of internal modifications to included packages; omit if unneeded

,* Prerequisites
This module has no prerequisites.

,* Features
# An in-depth list of features, how to use them, and their dependencies.

,* Configuration
# How to configure this module, including common problems and how to address them.

,* Troubleshooting
# Common issues and their solution, or places to look for help.
#+end_src
**** packages.el
#+begin_src emacs-lisp :tangle modules/app/mastodon/packages.el :mkdirp yes
(package! mastodon)
#+end_src

*** Telega - full featured unofficial client for Telegram platform for GNU Emacs.
**** Installation
telega depends on the visual-fill-column and rainbow-identifiers packages.
This dependency automatically installs if you install telega from MELPA or
GNU Guix. Otherwise, you will need to install these packages by hand.

telega is built on top of the official library provided by Telegram TDLib.
Most distributions do not provide this package in their repositories, in
which case you will have to install it manually by following the instructions.

GNU Guix, however, does have both telega and TDLib packaged.
If you use GNU Guix you can skip directly to Installing from GNU Guix.

***** Dependencies
Look for all dependencies at [[https://zevlg.github.io/telega.el/][Telega Manual (v0.7.018)]]
****** GNU gperf (for building TDLib)
******* Guix users
#+begin_src sh :tangle no
guix install gperf
#+end_src

***** Building TDLib

TDLib is the library for building Telegram clients. It requires a large amount of memory to be built.
Make sure you are using TDLib version greater or equal to 1.7.0.

On MacOS you can install a pre-built TDLib package using Homebrew from brew.sh.
Just run:

#+begin_src sh :tangle no
brew install tdlib
#+end_src
On Linux, you will need to build TDLib from source.

To get the source:

#+begin_src sh :tangle no
git clone https://github.com/tdlib/td.git
#+end_src

Move into the folder with $ cd ./td or wherever you checked out td.

Prepare a folder for building the library:

#+begin_src sh :tangle no
cd ./td && mkdir build && cd build && cmake ../
#+end_src

Build the sources:

#+begin_src sh :tangle no
cd ./td/build && make -jN # Change N first, read a description below.
#+end_src

With N number of cores that should be used for the compilation
(the optimal value is the number of physical cores on the machine).

Finally, to install the library system-wide:

#+begin_src sh :dir (concat /sudo::/home/" user-login-name "/.doom.d") :tangle no
cd ./td/build && sudo make install
#+end_src

It will install headers to =/usr/local/include= and library itself into =/usr/local/lib=.
If you have TDLib installed in other location, don't forget to modify ~telega-server-libs-prefix~ before starting telega.
#+begin_src emacs-lisp :tangle no
;; I'm a Guix user.
(use-package telega-server
  :defer t
  :when (featurep! :app telega)
  :config
  (setq! telega-server-libs-prefix "~/.guix-profile"))
#+end_src
***** Installing telega from MELPA

+ ~install~ as a doom :app module (You need to add =telega= at :app in =init.el=)

  #+begin_src emacs-lisp :tangle modules/app/telega/packages.el :mkdirp yes
;; -*- no-byte-compile: t; -*-
;;; app/telega/packages.el

(package! telega)
  #+end_src

- ~uninstall~ by replace =:tangle= value in ~install~ block with =no= and just press enter at the block below:
  #+begin_src sh :tangle no
rm -r modules/app/telega
  #+end_src

** Terminal :term:
*** vterm
In Vterm I prefer =ESC= to be a ~vterm--self-insert~
#+begin_src emacs-lisp
;;; :term vterm
(add-hook 'vterm-mode-hook #'evil-collection-vterm-toggle-send-escape)
#+end_src
Other keybinds these should be...
#+name: vterm-kbd
#+begin_src emacs-lisp :tangle no
(:when (featurep! :term vterm)
 :map vterm-mode-map
 :i "C-j"   #'vterm--self-insert
 "C-c C-x"  #'vterm--self-insert)
#+end_src
** Configure :config:
*** default
More keybinds for literate configs
#+name: default
#+begin_src emacs-lisp :tangle no
:map  help-map
"rk"       #'keychain-refresh-environment
"di"  (cmd! (find-file (expand-file-name "init.org"     doom-private-dir)))
"do"  (cmd! (find-file (expand-file-name "config.org"   doom-private-dir)))
"dpo" (cmd! (find-file (expand-file-name "packages.org" doom-private-dir)))
#+end_src
* Local Configures
** Directory Local Variables
=SPC p e= ~projectile-edit-dir-locals~
This command let you custom project variables in =.dir-locals.el=
For more information see (info "(emacs) Directory Variables")

#+begin_src emacs-lisp :tangle .dir-locals.el
((nil . ((projectile-project-name . "oh-my-system") ; Edit project name .doom.d
         (indent-tabs-mode . nil)
         (git-commit-major-mode . git-commit-elisp-text-mode)
         (fill-column . 80)
         (sentence-end-double-space . t)
         (emacs-lisp-docstring-fill-column . 75)
         (project-vc-merge-submodules . nil)))
 (org-mode . ((flycheck-textlint-executable . "node_modules/.bin/textlint"))))
#+end_src
To makes README.org buffer read-only

#+begin_src emacs-lisp :tangle modules/.dir-locals.el
((org-mode (buffer-read-only . t)))
#+end_src
** safe-local-variables
Emacs treat some variable as a risky-local-variable and will request your
permission to apply these variables every time when accessing a file within a
directory that contains settings for these variable in =.dir-locals.el= file.

#+begin_src emacs-lisp
;;
;;; Local Variables
(put 'flycheck-textlint-executable 'safe-local-variable #'stringp)
(put 'quickrun-option-command      'safe-local-variable #'stringp)
#+end_src

** Marking the root of a project
~projectile-project-root-files-bottom-up~
A list of files considered marking the root of a project.

#+begin_src emacs-lisp :tangle no
(after! projectile
   (setq projectile-project-root-files-bottom-up
       (remove ".git" projectile-project-root-files-bottom-up)))
#+end_src

#+RESULTS:
| .projectile | .project |

#+Original Value:
| .projectile | .git | .hg | .fslckout | _FOSSIL_ | .bzr | _darcs |
