config.el
(add-hook 'vterm-mode-hook #'evil-collection-vterm-toggle-send-escape)

;;
;;; Local Variables
(put 'flycheck-textlint-executable 'safe-local-variable #'stringp)
(put 'quickrun-option-command      'safe-local-variable #'stringp)
